invoice-tool/tests/unit/assets/excel_invoice_data.json

[
    {},
    {
        "From Delivery Date": "28/05/2022",
        "To Delivery Date": "30/06/2022",
        "Invoice Number": "3740410",
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA2",
        "Total Amount": 190617.3,
        "Currency": "EUR",
        "Credit Bank Account": "NO8660190447513",
        "Debit Bank Account": "DE36280400460409701003",
        "Invoice Date": "01/07/2022",
        "Due Date": "04/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987128",
        "Country/Region": "Germany",
        "Paid": "No"
    },
    {
        "From Delivery Date": "30/05/2022",
        "To Delivery Date": "30/06/2022",
        "Invoice Number": "3740489",
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA3",
        "Total Amount": -1252.92,
        "Currency": "EUR",
        "Credit Bank Account": "DE36280400460409701003",
        "Debit Bank Account": "NO8660190447513",
        "Invoice Date": "01/07/2022",
        "Due Date": "05/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987227",
        "Country/Region": "Germany",
        "Paid": "No"
    },
    {
        "From Delivery Date": "05/06/2022",
        "To Delivery Date": "29/06/2022",
        "Invoice Number": "3739817",
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA2",
        "Total Amount": 714906.69,
        "Currency": "EUR",
        "Credit Bank Account": "NO8660190447513",
        "Debit Bank Account": "DE36280400460409701003",
        "Invoice Date": "30/06/2022",
        "Due Date": "01/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1985606",
        "Country/Region": "Germany",
        "Paid": "Yes"
    },
    {
        "From Delivery Date": "10/06/2022",
        "To Delivery Date": "30/06/2022",
        "Invoice Number": "3740415",
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA1",
        "Total Amount": 5238.85,
        "Currency": "EUR",
        "Credit Bank Account": "NO8660190447513",
        "Debit Bank Account": "DE36280400460409701003",
        "Invoice Date": "01/07/2022",
        "Due Date": "04/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987174",
        "Country/Region": "Germany",
        "Paid": "No"
    }
]