invoice-tool/tests/unit/assets/excel_merge.json

[
    {},
    {
        "From Delivery Date": "20/06/2022",
        "To Delivery Date": "30/06/2022",
        "Invoice Number": 3740489,
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA3",
        "Total Amount": -1252.92,
        "Currency": "EUR",
        "Credit Bank Account": "DE36280400460409701003",
        "Debit Bank Account": "NO8660190447513",
        "Invoice Date": "01/07/2022",
        "Due Date": "05/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987227",
        "Country/Region": "Germany",
        "Paid": "No"
    },
    {
        "From Delivery Date": "20/08/2022",
        "To Delivery Date": "30/08/2022",
        "Invoice Number": 3740489,
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA3",
        "Total Amount": -1252.92,
        "Currency": "EUR",
        "Credit Bank Account": "DE36280400460409701003",
        "Debit Bank Account": "NO8660190447513",
        "Invoice Date": "01/07/2022",
        "Due Date": "05/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987227",
        "Country/Region": "Germany",
        "Paid": "No"
    },
    {
        "From Delivery Date": "20/10/2022",
        "To Delivery Date": "30/10/2022",
        "Invoice Number": "3740410",
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA2",
        "Total Amount": 190617.3,
        "Currency": "EUR",
        "Credit Bank Account": "NO8660190447513",
        "Debit Bank Account": "DE36280400460409701003",
        "Invoice Date": "01/07/2022",
        "Due Date": "04/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987128",
        "Country/Region": "Germany",
        "Paid": "No"
    },
    {
        "From Delivery Date": "20/01/2023",
        "To Delivery Date": "30/01/2023",
        "Invoice Number": 3740489,
        "Legal Entity Name": "EWE TRADING GmbH",
        "Invoice Account": "N01240-IA3",
        "Total Amount": -1252.92,
        "Currency": "EUR",
        "Credit Bank Account": "DE36280400460409701003",
        "Debit Bank Account": "NO8660190447513",
        "Invoice Date": "01/07/2022",
        "Due Date": "05/07/2022",
        "Markets": "NPSID",
        "Reference Number": "N-1987227",
        "Country/Region": "Germany",
        "Paid": "No"
    }
]